/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wgan <wgan@student.42kl.edu.my>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/11/06 15:08:15 by wgan              #+#    #+#             */
/*   Updated: 2025/11/06 15:08:16 by wgan             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
#include <ctype.h>

int	main(void)
{
	//char *c = "ま";
	char c = 'a';

	printf("%c\n", isalpha(c));
	printf("%i\n", isascii(c));
	printf("%c\n", isprint(c));
	printf("%s\n", "ま");
}
